Repository: AigizK/bashkort-parallel-corpora
Catalog: tmx/Эвклид3596.tmx
Source language: ru
Languages: ba

source: В этом пространном виде дал я науке название Воображаемой Геометрии, где как частный случай входит Употребительная Геометрия.
ba: Арауыҡлы ҡиәфәттәге был фәнгә мин Күҙалланыусы Геометрия тигән исем бирҙем, Ҡулланма Геометрия уға бер өлөш кенә булып инеп китә.

source: Трагическая судьба Лобачевского, подвергнутого остракизму в научном мире и служебном окружении за слишком смелые мысли, показала, что опасения Гаусса были не напрасны.
ba: Лобачевскийҙың фажиғәле яҙмышы, үтә ҡыйыу ҡараштары өсөн ғилми донъяла һәм эш урынында остракизмға дусар ителеүе Гаусстың хәүефләнеүҙәре нигеҙһеҙ түгеллеген раҫлай.

source: Но и его борьба была не напрасна.
ba: Ләкин уның көрәше лә эҙһеҙ үтмәй.

source: По иронии судьбы торжество смелых идей Лобачевского обеспечил (посмертно) осторожный Гаусс.
ba: Яҙмыш шаяртыуы буйынса, ҡыйыу Лобачевский идеяларының тантанаһын үтә һаҡ Гаусс (үлгәндән һуң) тәьмин итә.

source: В 1860-е годы была опубликована переписка Гаусса, в том числе несколько восторженных отзывов о геометрии Лобачевского, и это привлекло внимание к трудам русского математика.
ba: 1860-сы йылдарҙа Гаусстың хаттары, шул иҫәптән Лобачевский геометрияһы тураһындағы һоҡланыулы фекерҙәре, донъя күрә, һәм был урыҫ математигының хеҙмәттәренә иғтибар йәлеп итә.

source: В 1868 году вышла статья Э. Бельтрами, который показал, что плоскость Лобачевского имеет постоянную отрицательную кривизну (у евклидовой плоскости кривизна нулевая, у сферы — положительная); очень быстро неевклидова геометрия приобрела легальный научный статус, хотя всё ещё рассматривалась как чисто умозрительная.
ba: 1868 йылда Эудженио Бельтрами мәҡәләһе баҫылып сыға, ул Лобачевский яҫылығының даими кире кәкрелеген раҫлай (Евклид яҫылығының кәкрелеге нуль, сфераныҡы — ыңғай); тиҙ арала Евклидтыҡы булмаған геометрия, әле һаман фекерҙә генә йәшәһә лә, легаль ғилми статус ала.

source: В конце XIX—начале XX века сначала математики (Бернхард Риман, Уильям Кингдон Клиффорд), а затем и физики (Общая теория относительности, Эйнштейн), окончательно покончили с догматом о евклидовой геометрии физического пространства.
ba: XIX быуат аҙағы — XX быуат башында тәүҙә математиктар (Бернхард Риман, Уильям Кингдон Клиффорд), шунан физиктар (Дөйөм сағыштырмалыҡ теорияһы, Эйнштейн), Евклидтың физик арауыҡ геометрияһы тураһындағы догматты юҡҡа сығара.

source: О доказательстве независимости
ba: Бойондороҡһоҙлоҡты иҫбатлау

source: Независимость пятого постулата означает, что его отрицание не противоречит остальным аксиомам геометрии (при условии что геометрия Евклида непротиворечива).
ba: Бишенсе постулаттың бойондороҡһоҙлоғон иҫбатлау

source: Одновременно это означает непротиворечивость геометрии Лобачевского.
ba: Яңы геометрияның ҡапма-ҡаршылыҡһыҙ булыуын Лобачевский ҙа, Бойяи ҙа иҫбатлай алмай — ул саҡта математиканың ҡеүәтле саралары булмай.

source: На самом деле верна следующая теорема.
ba: Ысында иһә, киләһе теорема хаҡ.

source: Геометрия Лобачевского непротиворечива тогда и только тогда, когда непротиворечива евклидова геометрия.
ba: Евклидтың геомертрияһы ҡаршылыҡһыҙ булған осраҡта һәм шул осраҡта ғына Лобачевскийҙың геометрияһы ҡапма-ҡаршылыҡһыҙ.

source: Для доказательства этой теоремы в современной математике используются модели одной геометрии в другой.
ba: Был теореманы иҫбатлау өсөн хәҙерге заман математикаһында бер геометрияның моделдәре икенсеһендә ҡулланыла.

source: В модели для точек, прямых и других объектов первой геометрии строятся объекты в рамках второй геометрии так, что для построенных объектов выполняются аксиомы первой.
ba: Беренсе геометрияның нөктә, тура һыҙыҡ һәм башҡа объекттар өсөн моделендә икенсе геометрия сиктәрендә объекттар, төҙөлгән объкттар өсөн беренсе геметрияның аксиомалары үтәлерлек итеп, төҙөлә

source: Таким образом, если бы противоречие нашлось в первой системе аксиом, то оно нашлось бы и во второй.
ba: Шулай итеп, ҡапма-ҡаршылыҡ аксиомаларҙың беренсе системаһында килеп сыҡҡан булһа, икенсеһендә лә табылыр ине.

source: Сложно точно указать, кто и когда доказал эту теорему.
ba: Был тереманы кем һәм ҡасан яҡлауын әйтеүе ауыр.

source: В некотором смысле можно считать, что это было сделано уже Лобачевским.
ba: Ниндәйҙер мәғәнәлә, быны Лобачевский үҙе үк эшләгән тип тә өйтергә була.

source: Действительно, Лобачевский заметил, что геометрия орисферы в пространстве Лобачевского является ничем иным, как Евклидовой плоскостью; таким образом, существование противоречия в евклидовой геометрии влекло бы противоречие в геометрии Лобачевского.
ba: Ысынлап та, Лобачевский, Евклид яҫылығының Лобачевский арауығындағы орисфера геомертияһы икәне һиҙә; шулай итеп, евклид геометрияһында ҡапма-ҡаршылыҡтарҙың булыуы, Лобачевский геометиряһына ла ҡапма-ҡаршылыҡтар индерер ине.

source: На современном языке, Лобачевский построил модель евклидовой плоскости в пространстве Лобачевского.
ba: Хәҙергә тел менән өйткәндә, Лобачевский евклид яҫылығы моделен Лобачевский арауығында төҙөгән.

source: В обратную сторону его построение шло аналитически, и непротиворечивость геометрии Лобачевского следовала из непротиворечивости вещественного анализа.
ba: Уның төҙөлөшө кире яҡҡа аналитик рәүешәт бара, Лобачевскийҙың геомаерияһының ҡапма-ҡашылыҡһыҙ булыуы, уның материаль анализының ҡапма-ҡаршылыҡһыҙлығынан сыға.

source: Несмотря на наличие этих инструментов, Лобачевский не формулировал саму теорему непротиворечивости.
ba: Ошо ҡулланмалары булыуға ҡарамаҫтан, Лоачевский ҡапма-ҡаршыһыҙлыҡ теоремаһын формалаштырмай.

source: Для её строгой формулировки был необходим логический анализ оснований геометрии, сделанный позже Пашем, Гильбертом и другими.
ba: Уның аныҡ формулировкалау өсөн геометрия нигеҙҙәренең логик анализы кәрәк ине, был һуңғары Паш, Гильберт һ.б. тарафынан башҡарыла.

source: Появлением концепции модели мы обязаны Бельтрами.
ba: Модель концепцияһының барлыҡҡа килеүенә беҙ Бельтрамға бурыслы.

source: В 1868 году он построил проективную модель, конформно-евклидову модель, а также локальную модель на так называемой псевдосфере.
ba: 1868 йылда ул псевдосферала проектив модель, евклидтың конформ моделен, һәм шулай уҡ локаль модель төҙөй.

source: Бельтрами также был первым, кто увидел связь геометрии Лобачевского с дифференциальной геометрией.
ba: Бельтарам шулай уҡ Лобачевскийҙың геометрияһы менән дифференциаль гемоеметрия араһында бәйләнеш барлығын күреүселәрҙең тәүгеһе була.

source: Построенные Бельтрами модели были развиты позже Клейном и Пуанкаре, благодаря им построение было значительно упрощено, и также были обнаружены связи и приложения новой геометрии к проективной геометрии и комплексному анализу.
ba: Тик 40 йылдан ғына Клейн моделе (1871) һәм Пуанкаре моделе (1882) барлыҡҡа килә, улар Лобачевский геометрияһының аксиоматикаһын Евклид геометрияһы нигеҙендә ғәмәлгә ашыра.

source: Эти модели убедительно доказывают, что отрицание V постулата не противоречит остальным аксиомам геометрии; отсюда вытекает, что V постулат независим от остальных аксиом и доказать его невозможно.
ba: Был моделдәр ышандырырлыҡ итеп шуны иҫбатлай: V постулатты инҡар итеү геометрияның башҡа аксиомаларына ҡаршы килмәй; тимәк, V постулат башҡа аксиомаларға бойондороҡло түгел һәм уны иҫбат итеү шулай уҡ мөмкин түгел.

source: Пятый постулат и другие геометрии
ba: Бишенсе постулат һәм башҡа геметриялар

source: Как показано выше, добавление пятого постулата или его отрицания к остальным аксиомам Евклида формирует геометрию Евклида или геометрию Лобачевского соответственно.
ba: Үрҙә күрһәтелеүенсә, Евклидттың аксиомаларына бишенсе постулат йәки уның инҡар ителеүе өҫтәлеүе, Евклид геометрияһын йәки ярашлы рәүештә Лобачевсикй геометрияһын формалаштыра.

source: Для других распространённых однородных геометрий роль пятого постулата не столь велика.
ba: Башҡа киң таралған бертөрлө геометриялар өсөн бишенсе постулаттың әһәмиәте артыҡ ҙур булмай.

source: Система аксиом сферической геометрии требует более существенной переделки аксиом Евклида, поскольку в ней нет параллельных прямых.
ba: Сферик геометрияның аксиомалар системаһы, уларҙа параллель тураһыҙыҡтар булмағанлыҡтан, күпкә мөһимерәк үҙгәртеү талап итә.

source: В проективной геометрии можно определить параллельные прямые как прямые, которые пересекаются только в бесконечно удалённой точке; тогда пятый постулат становится простым следствием аксиомы: «через две точки можно провести одну и только одну прямую».
ba: Проектив геометрияла параллель тура һыҙыҡтарҙы сикһеҙ алыҫлаштырылған нөктәлә киҫешеүсе итеп билдәләргә була; был осраҡта бишенсе постулат: "ике нөктә аша бер һәм тик бер генә тура һыҙыҡ үткәреп була" тигән аксиоманың ябай һөҙөмтәһе булып ҡала.

source: В самом деле, если задать прямую L и точку P вне её и затем применить указанную аксиому для P и бесконечно удалённой точки, то полученная прямая будет параллельна L и, очевидно, определена однозначно.
ba: Ысынлап та, L тура һыҙығын һәм унан тыш Р нөктәһе алып, һуңынан күрһәтелгән аксиоманы Р өсөн ҡулланғанда, килеп сыҡҡан тура һыҙыҡ L тураһыҙығына паралелль буласаҡ, һәм, һис шикһеҙ, бер мәғәнәле итеп билдәләнеләсәк.
